app/views/cases/new.html.erb

SELECT `case_types`.* FROM `case_types`
---
    <%= f.label :case_type_id, t("case.case_type") %>
    <%= collection_select :case, :case_type_id, CaseType.all, :id, :name_i18n, {}, {:class => "form-control"} %>

SELECT `domains`.* FROM `domains`
---
    <%= f.label :domain_id, t("case.domain") %>
    <%= collection_select :case, :domain_id, Domain.all, :id, :name_i18n, {}, {:class => "form-control"} %>

SELECT `quality_levels`.* FROM `quality_levels`
---
    <%= f.label :quality_level, t("case.quality_level") %>
    <%= collection_select :case, :quality_level_id, QualityLevel.all, :id, :name_i18n, {}, {:class => "form-control"} %>